my_thinks = {"корабель", "їжа", "компас", "навігатор", "хороший телефон", "годинник", "ліки","сигнальні ракети", "роботи-лікарі","роботи-помічники"}
mum_thinks  = {"інструменти", "гамак", "ліки", "сонячна панель з акумулятором","гаджет","палатка", "спальник", "сонце захистний крем", "старлінк","сірники"}
fazer_thinks  = {"моторний човен з повним баком", "супутниковий телефон", "їжа", "одяг","мачете","рушниця", "боєкомплект", "туристична плита", "балон газу","сірники"}

print("у мене з мамою спільні такі речі:", my_thinks.intersection(mum_thinks))
print("у мене з татом спільні такі речі:", my_thinks.intersection(fazer_thinks))
print("у мене з мамою відмінні такі речі:", my_thinks.difference(mum_thinks))
print("у мене з татом відмінні такі речі:", my_thinks.difference(fazer_thinks))