import random as r
import time as t
actions = {
        1: "Зроби 5 присідань. Енергія — це сила! 🏋️",
        2: "Випий трохи води. Твій мозок скаже 'дякую'. 💧",
        3: "Постій на одній нозі 15 секунд, як фламінго. 🦩",
        4: "Підійди до дзеркала і щиро посміхнись собі. 😁",
        5: "Назви 3 столиці будь-яких країн світу. 🌍",
        6: "Спробуй дотягнутися до носків, не згинаючи колін. 🤸"
    }
dice_faces = {
    1: "╔═════════╗\n║         ║\n║    ●    ║\n║         ║\n╚═════════╝",
    2: "╔═════════╗\n║  ●      ║\n║         ║\n║      ●  ║\n╚═════════╝",
    3: "╔═════════╗\n║  ●      ║\n║    ●    ║\n║      ●  ║\n╚═════════╝",
    4: "╔═════════╗\n║  ●   ●  ║\n║         ║\n║  ●   ●  ║\n╚═════════╝",
    5: "╔═════════╗\n║  ●   ●  ║\n║    ●    ║\n║  ●   ●  ║\n╚═════════╝",
    6: "╔═════════╗\n║  ●   ●  ║\n║  ●   ●  ║\n║  ●   ●  ║\n╚═════════╝"
}
while True:
    input("\nНатисни Enter, щоб кинути кубик...")

    a = r.randint(1, 6)
    print(dice_faces[a])
    message = f"👉 {actions[a]}"
    print(message)
    print("-" * (len(message)+2))
